[
    {
        "id": 1,
        "companyName": "MicroCenter",
        "location": "Vienna, VA",
        "position": "Sales Associate",
        "startDate": "06/2019",
        "endDate": "12/2021",
        "jobDescription": [
            {
                "position": "Sales Associate",
                "one": "Consistently ranked among the top sales associates, achieving high sales targets and exceeding customer expectations.",
                "two": "Recognized with multiple \"Employee of the Month\" awards for outstanding performance, customer service, and teamwork.",
                "three": "Provided expert product knowledge and personalized recommendations, ensuring customers received exceptional service and satisfaction."
            }
        ],
        "imageUrl": "/pictures/microCenterLogo.jpeg"
    },
    {
        "id": 2,
        "companyName": "Bradley Department of Electrical and Computer Engineering",
        "location": "Blacksburg, VA",
        "position": "Software Systems Engineering Intern",
        "startDate": "05/2022",
        "endDate": "07/2022",
        "jobDescription": [
            {
                "position": "Software Systems Engineering Intern",
                "one": "Analyzed system performance using profiling tools to gather CPU usage data for various functions within the lighttpd web server.",
                "two": "Performed benchmarking tests on software components to evaluate performance under different system configurations.",
                "three": "Created and maintained detailed documentation for system configurations and performance benchmarks."
            }
        ],
        "imageUrl": "/pictures/bradleyLogo.png"
    },
    {
        "id": 3,
        "companyName": "ShiftMed",
        "location": "Mclean, VA",
        "position": "Credential Coordinating Intern",
        "startDate": "04/2020",
        "endDate": "05/2023",
        "jobDescription": [
            {
                "position": "Credential Coordinating Intern",
                "one": "Coordinated and processed credentialing documents for healthcare professionals, ensuring all required documentation was accurate and complete.",
                "two": "Communicated with candidates and vendors to gather necessary information and resolve any discrepancies in credentialing materials.",
                "three": "Maintained organized records and tracked the status of credentialing applications to ensure timely and compliant onboarding."
            }
        ],
        "imageUrl": "/pictures/shiftMedLogo.jpg"
    },
    {
        "id": 4,
        "companyName": "Hume Center for National Security and Technology",
        "location": "Blacksburg, VA",
        "position": "Undergraduate Research Assistant",
        "startDate": "09/2022",
        "endDate": "12/2022",
        "jobDescription": [
            {
                "position": "Undergraduate Research Assistant",
                "one": "Researched Data Fusion for Ship Wake Detection, focusing on classifier uncertaintity and data fusion algorithms.",
                "two": "Applied Data augmentation techniques to maritime imagery, achieving 87% accuracy in ship wake detection.",
                "three": "Presented findings at research meeting, contributing to ongoing project development."
            }
        ],
        "imageUrl": "/pictures/humecenterLogo.jpeg"
    },
    {
        "id": 5,
        "companyName": "Northrop Grumman",
        "location": "Baltimore, MD",
        "position": "Software Engineering Intern",
        "startDate": "06/2023",
        "endDate": "08/2023",
        "jobDescription": [
            {
                "position": "Software Engineering Intern",
                "one": "Transformed portions of legacy Borland C codebast into C#, imporving codebase readability and maintainability.",
                "two": "Conducted extensive unit testing and code validation, ensuring full compatibility with target systems.",
                "three": "Collaborated with a cross functional team to identify and resolve performance bottlenecks."
            }
        ],
        "imageUrl": "/pictures/NGLogo.png"
    },
    {
        "id": 6,
        "companyName": "Booz Allen Hamilton, Inc",
        "location": "Alexandria, VA",
        "position": "Software Developer, Web Expert",
        "startDate": "08/2024",
        "endDate": "current",
        "jobDescription": [
            {
                "position": "Data Science Tech Excellence Program",
                "date": "08/2024 - 11/2024",
                "one": "Completed a intensive program in data science, focusing on Python and machine learning.",
                "two": "Gained experience in data manipulation, preparation, and exploratory analysis.", 
                "three": "Worked on capstone project to predict NFL plays using Multinomial Regression, Decision Tree, and Neural Netowork."
            },
            {
                "position": "Full Stack Software Developer (GIG)",
                "date": "12/2024 - current",
                "one": "Worked on a full-stack web application to handle web services, using Node.js and React.",
                "two": "Collaborated on RESTful APIs to ensure seamless data flow between front-end and back-endcomponents.",
                "three": "Supported a PostgreSQL database management to store and retrieve data efficiently."
            }
        ],
        "imageUrl": "/pictures/boozAllenLogo.jpg"
    }
    

]   